# EA_DataAccAdvDlg

## Description
Shows an advanced settings dialog.

```pascal
FUNCTION EA_DataAccAdvDlg(acc : INTEGER): BOOLEAN;
```

```python
def vs.EA_DataAccAdvDlg(acc):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library